In [1]:
# Import dependencies

import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import psycopg2

In [2]:
# Load the cleaned NYC dogs dataset and convert to Dataframe
dog_data_file_path = "Resources/NYC_dogs_clean_forclass.csv"
NYC_dog_data_cleaned = pd.read_csv(dog_data_file_path)
NYC_dog_data_df = pd.DataFrame(NYC_dog_data_cleaned)
NYC_dog_data_df.tail()

,Unnamed: 0,AnimalName,AnimalGender,AnimalBirthMonth,BreedName,Borough,ZipCode,CommunityDistrict,CensusTract,NTA,CityCouncilDistrict,CongressionalDistrict,StateSenatorialDistrict,LicenseIssuedDate,LicenseExpiredDate
117619,121857,ROCKY,M,6,Boston Terrier,Manhattan,10022,106.0,98.0,MN19,4.0,12.0,28.0,12/31/16,12/31/18
117620,121858,ROXY,F,10,"Collie, Border",Brooklyn,11219,311.0,250.0,BK28,38.0,10.0,22.0,12/31/16,9/18/18
117621,121859,VALENTINA,F,5,German Shepherd Crossbreed,Staten Island,10312,503.0,17008.0,SI48,51.0,11.0,24.0,12/31/16,12/31/17
117622,121860,VENUS,F,12,Yorkshire Terrier,Bronx,10455,201.0,79.0,BX34,8.0,15.0,29.0,12/31/16,6/6/17
117623,121861,WILLOW,F,3,Unknown,Manhattan,10025,107.0,195.0,MN09,7.0,10.0,31.0,12/31/16,1/15/18

In [3]:
income_data_file_path = "Resources/income_by_year.csv"
NYC_income_data_cleaned = pd.read_csv(income_data_file_path)
NYC_income_data_df = pd.DataFrame(NYC_income_data_cleaned)
NYC_income_data_df.tail()

      CensusTract         2014         2015          2016  Grand Total
1308      1579.01  $78,641.00   $82,981.00    $93,466.00   $85,029.33
1309      1579.02  $89,395.00   $95,592.00   $103,125.00   $96,037.33
1310      1579.03  $81,173.00   $76,330.00    $82,148.00   $79,883.67
1311      1617.00  $88,125.00   $73,929.00    $76,045.00   $79,366.33
1312      1621.00  $74,861.00   $67,425.00    $65,114.00   $69,133.33

In [4]:
# Round census tract column of the income data DataFrame to 1 decimal place to match NYC dog data DataFrame
NYC_income_data_df['CensusTract'] = NYC_income_data_df['CensusTract'].round(decimals=1)

NYC_income_data_df.head()

   CensusTract          2014         2015          2016   Grand Total
0          1.0  $102,825.00   $99,372.50   $108,892.00   $103,696.50
1          2.0   $57,469.00   $57,005.33    $62,204.00    $58,892.78
2          2.0   $23,036.00   $20,521.00    $21,102.00    $21,553.00
3          2.0   $29,418.00   $29,684.00    $32,411.00    $30,504.33
4          3.0   $57,500.00   $59,688.00    $70,078.00    $62,422.00

In [5]:
# Retrieve the (cleaned) length of NYC_dog_data_df
len(NYC_dog_data_df)

117624

In [6]:
# Analyze the data types of the cleaned columns 
NYC_dog_data_df.dtypes

Unnamed: 0                   int64
AnimalName                  object
AnimalGender                object
AnimalBirthMonth             int64
BreedName                   object
Borough                     object
ZipCode                      int64
CommunityDistrict          float64
CensusTract                float64
NTA                         object
CityCouncilDistrict        float64
CongressionalDistrict      float64
StateSenatorialDistrict    float64
LicenseIssuedDate           object
LicenseExpiredDate          object
dtype: object

In [7]:
# Find the total number of adopted animals in NYC boroughs
NYC_dog_data_df.groupby('Borough')['AnimalName'].count()

Borough
Bronx            12309
Brooklyn         28893
Manhattan        41288
Queens           24047
Staten Island    10852
Name: AnimalName, dtype: int64

In [8]:
# initialize lists 
data = [['Bronx', 12309], ['Brooklyn', 28893], ['Manhattan', 41288], ['Queens', 24047], ['Staten Island', 10852]]
  
# Create a new DataFrame for total dog population in each NYC borough
NYC_dog_pop_df = pd.DataFrame(data, columns = ['borough', 'dog_population'])

NYC_dog_pop_df

         borough  dog_population
0          Bronx           12309
1       Brooklyn           28893
2      Manhattan           41288
3         Queens           24047
4  Staten Island           10852

In [9]:
# Create a new df of dog gender and boroughs
gender_boroughs_df = NYC_dog_data_df.filter(['AnimalGender','Borough'], axis=1)
gender_boroughs_df

       AnimalGender        Borough
0                 M       Brooklyn
1                 M       Brooklyn
2                 M          Bronx
3                 F       Brooklyn
4                 M          Bronx
...             ...            ...
117619            M      Manhattan
117620            F       Brooklyn
117621            F  Staten Island
117622            F          Bronx
117623            F      Manhattan

[117624 rows x 2 columns]

In [10]:
# Find the number of male and female dogs adopted in NYC
gender_boroughs_df.groupby(['Borough', 'AnimalGender'])['AnimalGender'].count()

Borough        AnimalGender
Bronx          F                5391
               M                6937
Brooklyn       F               13166
               M               15784
Manhattan      F               19247
               M               22080
Queens         F               10675
               M               13479
Staten Island  F                4968
               M                5897
Name: AnimalGender, dtype: int64

In [11]:
# Create a dataframe based off dog birth months
birth_month_boroughs_df = NYC_dog_data_df.filter(['AnimalBirthMonth','Borough'], axis=1)

birth_month_boroughs_df

        AnimalBirthMonth        Borough
0                      1       Brooklyn
1                     10       Brooklyn
2                      9          Bronx
3                      8       Brooklyn
4                     10          Bronx
...                  ...            ...
117619                 6      Manhattan
117620                10       Brooklyn
117621                 5  Staten Island
117622                12          Bronx
117623                 3      Manhattan

[117624 rows x 2 columns]

In [12]:
# Find the total number of animals born each month
data = birth_month_boroughs_df.groupby(['Borough','AnimalBirthMonth'])['AnimalBirthMonth'].count()

# Create a new DataFrame for total dog population in each NYC borough
NYC_dog_birth_df = pd.DataFrame(data)

NYC_dog_birth_df

                                AnimalBirthMonth
Borough       AnimalBirthMonth
Bronx         1                             2346
              2                              827
              3                              916
              4                              915
              5                              873
              6                              944
              7                              887
              8                              927
              9                              900
              10                             966
              11                             871
              12                             956
Brooklyn      1                             6179
              2                             1983
              3                             2084
              4                             2179
              5                             2155
              6                             2174
              7                             2045
              8                             2061
              9                             2052
              10                            2186
              11                            1888
              12                            1964
Manhattan     1                             8390
              2                             2927
              3                             3089
              4                             3196
              5                             3043
              6                             3212
              7                             3001
              8                             2881
              9                             2773
              10                            3033
              11                            2859
              12                            2923
Queens        1                             5345
              2                             1650
              3                             1796
              4                             1779
              5                             1753
              6                             1855
              7                             1851
              8                             1677
              9                             1550
              10                            1747
              11                            1616
              12                            1535
Staten Island 1                             3156
              2                              624
              3                              680
              4                              656
              5                              708
              6                              761
              7                              728
              8                              742
              9                              656
              10                             792
              11                             723
              12                             639

In [13]:
# Create a df of NYC dog breeds in boroughs
NYC_dog_breed_df = NYC_dog_data_df.filter(['BreedName','Borough'], axis=1)

NYC_dog_breed_df

                         BreedName        Borough
0                           Beagle       Brooklyn
1                            Boxer       Brooklyn
2                          Maltese          Bronx
3                              Pug       Brooklyn
4                          Maltese          Bronx
...                            ...            ...
117619              Boston Terrier      Manhattan
117620              Collie, Border       Brooklyn
117621  German Shepherd Crossbreed  Staten Island
117622           Yorkshire Terrier          Bronx
117623                     Unknown      Manhattan

[117624 rows x 2 columns]

In [14]:
# Rename columns and create and updated dog birth df
updated_NYC_dog_birth_df = NYC_dog_birth_df.rename(columns={'AnimalBirthMonth': 'Total'})

updated_NYC_dog_birth_df

                                Total
Borough       AnimalBirthMonth
Bronx         1                  2346
              2                   827
              3                   916
              4                   915
              5                   873
              6                   944
              7                   887
              8                   927
              9                   900
              10                  966
              11                  871
              12                  956
Brooklyn      1                  6179
              2                  1983
              3                  2084
              4                  2179
              5                  2155
              6                  2174
              7                  2045
              8                  2061
              9                  2052
              10                 2186
              11                 1888
              12                 1964
Manhattan     1                  8390
              2                  2927
              3                  3089
              4                  3196
              5                  3043
              6                  3212
              7                  3001
              8                  2881
              9                  2773
              10                 3033
              11                 2859
              12                 2923
Queens        1                  5345
              2                  1650
              3                  1796
              4                  1779
              5                  1753
              6                  1855
              7                  1851
              8                  1677
              9                  1550
              10                 1747
              11                 1616
              12                 1535
Staten Island 1                  3156
              2                   624
              3                   680
              4                   656
              5                   708
              6                   761
              7                   728
              8                   742
              9                   656
              10                  792
              11                  723
              12                  639

In [15]:
# Find the top breeds adopted in NYC boroughs
NYC_dog_breed_df['BreedName'].value_counts()

Unknown                    16419
Yorkshire Terrier           7358
Shih Tzu                    6848
Chihuahua                   5554
Labrador Retriever          4135
                           ...
Pyrenean Shepherd              1
Afghan Hound Crossbreed        1
Finnish Lapphund               1
Swedish Vallhund               1
Neapolitan Mastiff             1
Name: BreedName, Length: 299, dtype: int64

In [16]:
# Find the top types of breeds adopted in the Bronx
bronx_breeds = NYC_dog_breed_df[NYC_dog_breed_df['Borough'] == 'Bronx'].groupby('Borough')['BreedName'].value_counts()

# Convert to a pandas DataFrame
bronx_breeds_df = pd.DataFrame(data= bronx_breeds)

bronx_breeds_df

                                            BreedName
Borough BreedName
Bronx   Unknown                                  1508
        Yorkshire Terrier                        1183
        Shih Tzu                                 1083
        Chihuahua                                 845
        American Pit Bull Terrier/Pit Bull        718
...                                               ...
        Pug Crossbreed                              1
        Rat Terrier Crossbreed                      1
        Russell Terrier                             1
        Thai Ridgeback                              1
        Treeing Walker Coonhound                    1

[213 rows x 1 columns]

In [17]:
# Find the top types of breeds adopted in Brooklyn
brooklyn_breeds = NYC_dog_breed_df[NYC_dog_breed_df['Borough'] == 'Brooklyn'].groupby('Borough')['BreedName'].value_counts()

# Convert to a pandas DataFrame
brooklyn_breeds_df = pd.DataFrame(data= brooklyn_breeds)

brooklyn_breeds_df

                                               BreedName
Borough  BreedName
Brooklyn Unknown                                    4017
         Yorkshire Terrier                          1873
         Shih Tzu                                   1799
         Chihuahua                                  1420
         American Pit Bull Mix / Pit Bull Mix       1040
...                                                  ...
         Spanish Water Dog                             1
         Sussex Spaniel                                1
         Swedish Vallhund                              1
         Thai Ridgeback                                1
         Tibetan Mastiff                               1

[269 rows x 1 columns]

In [18]:
# Find the top types of breeds adopted in Manhattan
manhattan_breeds = NYC_dog_breed_df[NYC_dog_breed_df['Borough'] == 'Manhattan'].groupby('Borough')['BreedName'].value_counts()

# Convert to a pandas DataFrame
manhattan_breeds_df = pd.DataFrame(data= manhattan_breeds)

manhattan_breeds_df

                                       BreedName
Borough   BreedName
Manhattan Unknown                           5568
          Yorkshire Terrier                 1986
          Chihuahua                         1874
          Shih Tzu                          1768
          Labrador Retriever                1654
...                                          ...
          Polish Hound                         1
          Portuguese Sheepdog                  1
          Russian Wolfhound                    1
          Small Munsterlander Pointer          1
          Spanish Water Dog                    1

[281 rows x 1 columns]

In [19]:
# Find the top types of breeds adopted in Queens
queens_breeds = NYC_dog_breed_df[NYC_dog_breed_df['Borough'] == 'Queens'].groupby('Borough')['BreedName'].value_counts()

# Convert to a pandas DataFrame
queens_breeds_df = pd.DataFrame(data= queens_breeds)

queens_breeds_df

                                     BreedName
Borough BreedName
Queens  Unknown                           3580
        Yorkshire Terrier                 1617
        Shih Tzu                          1493
        Maltese                           1116
        Chihuahua                         1068
...                                        ...
        Thai Ridgeback                       1
        Tibetan Mastiff                      1
        Treeing Walker Coonhound             1
        Welsh Terrier                        1
        Wirehaired Pointing Griffon          1

[245 rows x 1 columns]

In [20]:
# Find the top types of breeds adopted in Staten Island
staten_island_breeds = NYC_dog_breed_df[NYC_dog_breed_df['Borough'] == 'Staten Island'].groupby('Borough')['BreedName'].value_counts()

# Convert to a pandas DataFrame
staten_island_breeds_df = pd.DataFrame(data= staten_island_breeds)

staten_island_breeds_df

                                  BreedName
Borough       BreedName
Staten Island Unknown                  1746
              Shih Tzu                  705
              Yorkshire Terrier         699
              Labrador Retriever        572
              Maltese                   388
...                                     ...
              St. Bernard                 1
              Standard Schnauzer          1
              Tibetan Spaniel             1
              Toy Fox Terrier             1
              Xoloitzcuintli              1

[211 rows x 1 columns]

In [21]:
# Join the Dog Data DataFrame to the Income Data DataFrame
NYC_joined_data_df = NYC_dog_data_df.join(NYC_income_data_df.set_index('CensusTract'), how = 'left', on ='CensusTract')

NYC_joined_data_df.head()

,Unnamed: 0,AnimalName,AnimalGender,AnimalBirthMonth,BreedName,Borough,ZipCode,CommunityDistrict,CensusTract,NTA,CityCouncilDistrict,CongressionalDistrict,StateSenatorialDistrict,LicenseIssuedDate,LicenseExpiredDate,2014,2015,2016,Grand Total
0,0,SHADOW,M,1,Beagle,Brooklyn,11236,318.0,1014.0,BK50,46.0,8.0,19.0,12/29/14,1/30/16,"$70,833.00","$60,969.00","$60,625.00","$64,142.33"
1,1,ROCCO,M,10,Boxer,Brooklyn,11210,314.0,756.0,BK43,45.0,9.0,17.0,1/7/15,1/30/16,"$66,090.00","$62,935.00","$83,026.00","$70,683.67"
2,2,LUIGI,M,9,Maltese,Bronx,10464,210.0,516.0,BX10,13.0,14.0,34.0,1/17/15,2/2/16,"$68,259.00","$65,695.50","$70,019.50","$67,991.33"
2,2,LUIGI,M,9,Maltese,Bronx,10464,210.0,516.0,BX10,13.0,14.0,34.0,1/17/15,2/2/16,"$31,062.00","$34,241.00","$42,220.00","$35,841.00"
2,2,LUIGI,M,9,Maltese,Bronx,10464,210.0,516.0,BX10,13.0,14.0,34.0,1/17/15,2/2/16,"$38,802.00","$38,813.00","$49,321.00","$42,312.00"

In [22]:
# Connect to postgres/pgAdmin
sql_pgadmin = psycopg2.connect(user="postgres", password="", host="localhost", port="5432", database="dog_licenses_db")

In [23]:
# Converting NYC_joined_data_df to csv
NYC_joined_data_df.to_csv('Resources/NYC_joined_data_df.csv', index=False)

In [24]:
# Converting NYC_dog_pop_df to csv
NYC_dog_pop_df.to_csv('Resources/NYC_dog_pop_df.csv', index=False)

In [27]:
# Test connection to database
query = "SELECT * FROM borough_dog_pop"
example_df = pd.read_sql(query, sql_pgadmin)
example_df

         borough  dog_population
0          Bronx           12611
1       Brooklyn           30351
2      Manhattan           42607
3         Queens           25138
4  Staten Island           11155